{
    "basics": {
        "name": "Siddharth Aasal",
        "email": "siddharthaasal@gmail.com",
        "portfolio": "https://www.siddharthaasal.xyz/"
    },
    "socials": {
        "github": "https://github.com/siddharthaasal",
        "linkedin": "https://www.linkedin.com/in/siddharthaasal/",
        "leetcode": "https://leetcode.com/u/siddharthaasal/",
        "medium": "https://medium.com/@siddharthaasal",
        "discord": "randome120"
    },
    "about": {
        "strength": "To lead and take initiative have been among my biggest strengths. I’ve led multiple academic research projects in college and guided my teams to the finals of several hackathons. I’ve consistently been able to keep the team focused under pressure and ensure we deliver quality results.",
        "weakness": "One area I’m working on is my tendency to take on too much at once — especially when I’m excited by multiple projects. While this drive helps me learn quickly, it can sometimes lead to delays. I’m learning to prioritize better and manage my bandwidth more effectively to ensure consistent output.",
        "description": "I’m a pre-final year Computer Science student with a specialization in Blockchain Technology. Over the past few years, I’ve led multiple academic research projects and taken my teams to the finals of several hackathons. I really enjoy working on real-world problems, especially where I can build something meaningful using technologies like React, Node.js, and Solidity. Most of my learning has come from hands-on projects — from decentralized apps to data structure benchmarking tools — and I like taking ownership of both the technical and collaborative aspects. I’m always curious and motivated to try new tools and approaches. At times, I do take on a bit too much out of excitement, but I’m learning to balance that with better prioritization and time management. Outside of academics, I enjoy arm-wrestling and trekking in the mountains to recharge and gain fresh perspective."
    },
    "addresses": {
        "original": {
            "street": "In Front of Shiv Temple, Bajrang Chowk",
            "city": "Bisauli, Budaun",
            "zip-code": "243720"
        },
        "correspondence": {
            "street": "Flat 120 UG, Pride City",
            "city": "Kharar, Mohali",
            "zip-code": "140301"
        }
    },
    "education": {
        "college": {
            "name": "Chandigarh University",
            "location": "Mohali, Punjab, India",
            "course": "B.E. in Computer Science (Blockchain Technology Specialization)",
            "marks": "8.72",
            "passingYear": "2026"
        },
        "XII": {
            "name": "Sacred Heart Convent School",
            "location": "Chandausi, Moradabad, India",
            "board": "ISC",
            "year": "2021",
            "marks": "91.8%"
        },
        "X": {
            "name": "Sacred Heart Convent School",
            "location": "Chandausi, Moradabad, India",
            "board": "ICSE",
            "year": "2019",
            "marks": "92.8%"
        }
    },
    "experience": {
        "metacrafters": {
            "what_i_did": "As part of the Summer Blockchain Program by Metacrafters, I built multiple decentralized applications (dApps) across Ethereum, Avalanche, and Polygon. I created an Ethereum-based dApp enabling users to perform transactions via MetaMask, integrated custom ERC-20 token logic, and explored smart contract interaction flows. I also developed a basic NFT bridge prototype to simulate cross-chain NFT transfers using token metadata replication. Throughout the program, I worked extensively with Solidity, Hardhat, Remix, and Web3.js, gaining real-world experience in deploying and interacting with smart contracts, optimizing gas usage, and designing user flows for Web3 applications."
        }
    }
}